layers/+tools/ranger/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-23 Mon 13:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Ranger contribution layer for Spacemacs</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/readtheorg.css" />
</head>
<body>
<div id="content">
<div id="toggle-sidebar"><a href="#table-of-contents"><h2>Table of Contents</h2></a></div>
<h1 class="title">Ranger contribution layer for Spacemacs</h1>
<div id="table-of-contents">
<h2>Table of Contents<a href="#">Close</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Description</a></li>
<li><a href="#orgheadline2">2. Features</a></li>
<li><a href="#orgheadline6">3. Configuration</a>
<ul>
<li><a href="#orgheadline3">3.1. Customizing</a></li>
<li><a href="#orgheadline4">3.2. Parent options</a></li>
<li><a href="#orgheadline5">3.3. Preview options</a></li>
</ul>
</li>
<li><a href="#orgheadline7">4. Key Bindings</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
This layer brings Ranger features to spacemacs from the <code>ranger</code> package.
</p>

<p>
To use this contribution add it to your <code>~/.spacemacs</code>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers '<span class="org-rainbow-delimiters-depth-2">(</span>ranger<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
To default with preview enabled when entering ranger:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq-default dotspacemacs-configuration-layers 
              '<span class="org-rainbow-delimiters-depth-2">(</span>ranger <span class="org-builtin">:variables</span>
                       ranger-show-preview t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Features</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>use ranger to display dired with ranger like preview and stacked parent windows.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
Most parameters can be toggled on and off and stay within the current emacs
session. Any settings that are desired on startup should be set below. 
</p>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Customizing</h3>
<div class="outline-text-3" id="text-3-1">
<p>
When disabling the mode you can choose to kill the buffers that were opened
while browsing the directories.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-cleanup-on-disable t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Or you can choose to kill the buffer just after you move to another entry in the
dired buffer.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-cleanup-eagerly t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You can choose to show dotfiles at ranger startup, toggled by `zh`
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-show-dotfiles t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Define custom function used to output header of primary ranger window. Must
return a string that is placed in the header-line.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-header-func 'ranger-header-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Define custom function used to output header of parent and preview windows. Must
return a string that is placed in the header-line.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-parent-header-func 'ranger-parent-header-line<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> Parent options</h3>
<div class="outline-text-3" id="text-3-2">
<p>
You can set the number of folders to nest to the left, adjusted by `z-` and `z+`
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-parent-depth <span class="org-highlight-numbers-number">2</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You can set the size of the parent windows as a fraction of the frame size
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-width-parents <span class="org-highlight-numbers-number">0.12</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
When increasing number of nested parent folders, set max width as fraction of
frame size to prevent filling up entire frame with parents.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-max-parent-width <span class="org-highlight-numbers-number">0.12</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Preview options</h3>
<div class="outline-text-3" id="text-3-3">
<p>
You can choose to show previews literally, or through find-file, toggled by `zi`
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-show-dotfiles t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You can set the size of the preview windows as a fraction of the frame size
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-width-preview <span class="org-highlight-numbers-number">0.55</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
You probably don't want to open certain files like videos when using preview. To
ignore certain files when moving over them you can customize the following to
your liking:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-ignored-extensions '<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"mkv"</span> <span class="org-string">"iso"</span> <span class="org-string">"mp4"</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
To set the max files size (in MB), set the following parameter:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>setq ranger-max-preview-size <span class="org-highlight-numbers-number">10</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">4</span> Key Bindings</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Binding</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC a r</code></td>
<td class="org-left">launch ranger</td>
</tr>

<tr>
<td class="org-left">SPC a d</td>
<td class="org-left">deer (minimal ranger window in current directory)</td>
</tr>

<tr>
<td class="org-left"><code>C-p</code></td>
<td class="org-left">(ranger) toggle ranger in dired buffer</td>
</tr>

<tr>
<td class="org-left"><code>j</code></td>
<td class="org-left">(ranger) navigate down</td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left">(ranger) navigate up</td>
</tr>

<tr>
<td class="org-left"><code>C-j</code></td>
<td class="org-left">(ranger) scroll preview window down</td>
</tr>

<tr>
<td class="org-left"><code>C-k</code></td>
<td class="org-left">(ranger) scroll preview window up</td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">(ranger) search for file names</td>
</tr>

<tr>
<td class="org-left"><code>i</code></td>
<td class="org-left">(ranger) show preview of current file</td>
</tr>

<tr>
<td class="org-left"><code>zi</code></td>
<td class="org-left">(ranger) toggle showing literal / full-text previews</td>
</tr>

<tr>
<td class="org-left"><code>zh</code></td>
<td class="org-left">(ranger) toggle showing dotfiles</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">(ranger) sort options</td>
</tr>

<tr>
<td class="org-left"><code>H</code></td>
<td class="org-left">(ranger) search through history</td>
</tr>

<tr>
<td class="org-left"><code>h</code></td>
<td class="org-left">(ranger) go up directory</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left">(ranger) find file / enter directory</td>
</tr>

<tr>
<td class="org-left"><code>RET</code></td>
<td class="org-left">(ranger) find file / enter directory</td>
</tr>

<tr>
<td class="org-left"><code>q</code></td>
<td class="org-left">(ranger) quit</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">(ranger) revert buffer</td>
</tr>

<tr>
<td class="org-left"><code>z-</code></td>
<td class="org-left">(ranger) reduce number of parents</td>
</tr>

<tr>
<td class="org-left"><code>z+</code></td>
<td class="org-left">(ranger) increment number of parents</td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left">(ranger) toggle all marks</td>
</tr>

<tr>
<td class="org-left"><code>V</code></td>
<td class="org-left">(ranger) visually select lines</td>
</tr>

<tr>
<td class="org-left"><code>S</code></td>
<td class="org-left">(ranger) enter shell</td>
</tr>

<tr>
<td class="org-left"><code>C-SPC</code></td>
<td class="org-left">(ranger) mark current file</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-23 Mon 13:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
